[Survived] Block
code/node-red-contrib-komfovent/komfnodes/komfovent.js:14:18
 
 module.exports = class Komfovent {
   // create at new instance of the class, connected to chosen unit. Remove if ending up useless...
-  constructor () {
-    const mode = {
-      home: '3=2',
-      away: '3=1',
-      auto: '285=2',
-      intensive: '3=3',
-      boost: '3=4',
-      fireplace: '283',
-      kitchen: '282'
-    };
-  } // constructor end
+  constructor () {} // constructor end
 
   /* private makeRequest()

[Survived] StringLiteral
code/node-red-contrib-komfovent/komfnodes/komfovent.js:17:13
   constructor () {
     const mode = {
       home: '3=2',
-      away: '3=1',
+      away: "",
       auto: '285=2',
       intensive: '3=3',

[Survived] StringLiteral
code/node-red-contrib-komfovent/komfnodes/komfovent.js:19:18
       home: '3=2',
       away: '3=1',
       auto: '285=2',
-      intensive: '3=3',
+      intensive: "",
       boost: '3=4',
       fireplace: '283',

[Killed] Block
code/node-red-contrib-komfovent/komfnodes/komfovent.js:31:34
   * TODO make private function, throw instead of return objects for the flow
   * @param postConfig The config object, axios standard, to make the request.
   */
-  async makeRequest (postConfig) {
-    // Make a request for logon
-    const request = require('axios');
-    try {
-      const result = await request(postConfig);
-      return result;
-    }
-    catch (err) {
-      if (err.errno === 'ENOTFOUND' || err.errno === 'EHOSTDOWN') {
-        return { error: true, result: err };
-      }
-      else {
-        return { error: true, result: err };
-      }
-    } // catch error end
-  }
+  async makeRequest (postConfig) {}
 
   /* public logon()

[Killed] StringLiteral
code/node-red-contrib-komfovent/komfnodes/komfovent.js:33:29
   */
   async makeRequest (postConfig) {
     // Make a request for logon
-    const request = require('axios');
+    const request = require("");
     try {
       const result = await request(postConfig);

[Killed] Block
code/node-red-contrib-komfovent/komfnodes/komfovent.js:34:9
   async makeRequest (postConfig) {
     // Make a request for logon
     const request = require('axios');
-    try {
-      const result = await request(postConfig);
-      return result;
-    }
+    try {}
     catch (err) {
       if (err.errno === 'ENOTFOUND' || err.errno === 'EHOSTDOWN') {

[Survived] Block
code/node-red-contrib-komfovent/komfnodes/komfovent.js:38:17
       const result = await request(postConfig);
       return result;
     }
-    catch (err) {
-      if (err.errno === 'ENOTFOUND' || err.errno === 'EHOSTDOWN') {
-        return { error: true, result: err };
-      }
-      else {
-        return { error: true, result: err };
-      }
-    } // catch error end
+    catch (err) {} // catch error end
   }
 

[Survived] BinaryExpression
code/node-red-contrib-komfovent/komfnodes/komfovent.js:39:11
       return result;
     }
     catch (err) {
-      if (err.errno === 'ENOTFOUND' || err.errno === 'EHOSTDOWN') {
+      if (err.errno === 'ENOTFOUND' && err.errno === 'EHOSTDOWN') {
         return { error: true, result: err };
       }

[Survived] ConditionalExpression
code/node-red-contrib-komfovent/komfnodes/komfovent.js:39:40
       return result;
     }
     catch (err) {
-      if (err.errno === 'ENOTFOUND' || err.errno === 'EHOSTDOWN') {
+      if (err.errno === 'ENOTFOUND' || false) {
         return { error: true, result: err };
       }

[NoCoverage] BooleanSubstitution
code/node-red-contrib-komfovent/komfnodes/komfovent.js:40:25
     }
     catch (err) {
       if (err.errno === 'ENOTFOUND' || err.errno === 'EHOSTDOWN') {
-        return { error: true, result: err };
+        return { error: false, result: err };
       }
       else {

[Survived] Block
code/node-red-contrib-komfovent/komfnodes/komfovent.js:42:12
       if (err.errno === 'ENOTFOUND' || err.errno === 'EHOSTDOWN') {
         return { error: true, result: err };
       }
-      else {
-        return { error: true, result: err };
-      }
+      else {}
     } // catch error end
   }

[Survived] BooleanSubstitution
code/node-red-contrib-komfovent/komfnodes/komfovent.js:43:25
         return { error: true, result: err };
       }
       else {
-        return { error: true, result: err };
+        return { error: false, result: err };
       }
     } // catch error end

[Killed] BinaryExpression
code/node-red-contrib-komfovent/komfnodes/komfovent.js:57:9
   */
   async logon (username, password, ip) {
     // validate input
-    if (typeof username !== 'string' || !username || typeof password !== 'string' || !password) {
+    if (typeof username === 'string' || !username || typeof password !== 'string' || !password) {
       return ({ error: true, result: 'Empty username/password received, quitting' });
     }

[Killed] PrefixUnaryExpression
code/node-red-contrib-komfovent/komfnodes/komfovent.js:57:41
   */
   async logon (username, password, ip) {
     // validate input
-    if (typeof username !== 'string' || !username || typeof password !== 'string' || !password) {
+    if (typeof username !== 'string' || username || typeof password !== 'string' || !password) {
       return ({ error: true, result: 'Empty username/password received, quitting' });
     }

[NoCoverage] BooleanSubstitution
code/node-red-contrib-komfovent/komfnodes/komfovent.js:58:24
   async logon (username, password, ip) {
     // validate input
     if (typeof username !== 'string' || !username || typeof password !== 'string' || !password) {
-      return ({ error: true, result: 'Empty username/password received, quitting' });
+      return ({ error: false, result: 'Empty username/password received, quitting' });
     }
     if (typeof ip !== 'string' || !ip) {

[NoCoverage] ObjectLiteral
code/node-red-contrib-komfovent/komfnodes/komfovent.js:58:15
   async logon (username, password, ip) {
     // validate input
     if (typeof username !== 'string' || !username || typeof password !== 'string' || !password) {
-      return ({ error: true, result: 'Empty username/password received, quitting' });
+      return ({});
     }
     if (typeof ip !== 'string' || !ip) {

[Killed] IfStatement
code/node-red-contrib-komfovent/komfnodes/komfovent.js:60:9
     if (typeof username !== 'string' || !username || typeof password !== 'string' || !password) {
       return ({ error: true, result: 'Empty username/password received, quitting' });
     }
-    if (typeof ip !== 'string' || !ip) {
+    if (true) {
       return ({ error: true, result: 'Empty IP received, quitting' });
     }

[Killed] ConditionalExpression
code/node-red-contrib-komfovent/komfnodes/komfovent.js:60:9
     if (typeof username !== 'string' || !username || typeof password !== 'string' || !password) {
       return ({ error: true, result: 'Empty username/password received, quitting' });
     }
-    if (typeof ip !== 'string' || !ip) {
+    if (true || !ip) {
       return ({ error: true, result: 'Empty IP received, quitting' });
     }

[NoCoverage] BooleanSubstitution
code/node-red-contrib-komfovent/komfnodes/komfovent.js:61:24
       return ({ error: true, result: 'Empty username/password received, quitting' });
     }
     if (typeof ip !== 'string' || !ip) {
-      return ({ error: true, result: 'Empty IP received, quitting' });
+      return ({ error: false, result: 'Empty IP received, quitting' });
     }
     const postConfig = {

[NoCoverage] StringLiteral
code/node-red-contrib-komfovent/komfnodes/komfovent.js:61:38
       return ({ error: true, result: 'Empty username/password received, quitting' });
     }
     if (typeof ip !== 'string' || !ip) {
-      return ({ error: true, result: 'Empty IP received, quitting' });
+      return ({ error: true, result: "" });
     }
     const postConfig = {

[Killed] BinaryExpression
code/node-red-contrib-komfovent/komfnodes/komfovent.js:64:12
       return ({ error: true, result: 'Empty IP received, quitting' });
     }
     const postConfig = {
-      url: 'http://' + ip,
+      url: 'http://' - ip,
       method: 'POST',
       body: '1=' + username + '&' + '2=' + password

[Survived] StringLiteral
code/node-red-contrib-komfovent/komfnodes/komfovent.js:65:15
     }
     const postConfig = {
       url: 'http://' + ip,
-      method: 'POST',
+      method: "",
       body: '1=' + username + '&' + '2=' + password
     };

[Survived] BinaryExpression
code/node-red-contrib-komfovent/komfnodes/komfovent.js:66:13
     const postConfig = {
       url: 'http://' + ip,
       method: 'POST',
-      body: '1=' + username + '&' + '2=' + password
+      body: '1=' - username + '&' + '2=' + password
     };
     const result = await this.makeRequest(postConfig);

[Survived] BinaryExpression
code/node-red-contrib-komfovent/komfnodes/komfovent.js:66:13
     const postConfig = {
       url: 'http://' + ip,
       method: 'POST',
-      body: '1=' + username + '&' + '2=' + password
+      body: '1=' + username + '&' + '2=' - password
     };
     const result = await this.makeRequest(postConfig);

[Killed] BinaryExpression
code/node-red-contrib-komfovent/komfnodes/komfovent.js:70:35
     };
     const result = await this.makeRequest(postConfig);
     // check that we are actually logged on
-    if (result === 'undefined' || result === '') {
+    if (result === 'undefined' || result !== '') {
       return { error: true, result: 'http request failed' };
     }

[Killed] IfStatement
code/node-red-contrib-komfovent/komfnodes/komfovent.js:70:9
     };
     const result = await this.makeRequest(postConfig);
     // check that we are actually logged on
-    if (result === 'undefined' || result === '') {
+    if (true) {
       return { error: true, result: 'http request failed' };
     }

[NoCoverage] BooleanSubstitution
code/node-red-contrib-komfovent/komfnodes/komfovent.js:71:23
     const result = await this.makeRequest(postConfig);
     // check that we are actually logged on
     if (result === 'undefined' || result === '') {
-      return { error: true, result: 'http request failed' };
+      return { error: false, result: 'http request failed' };
     }
     else if (result.data.indexOf('Incorrect password!') >= 0 || result.status > 200) {

[NoCoverage] ObjectLiteral
code/node-red-contrib-komfovent/komfnodes/komfovent.js:71:14
     const result = await this.makeRequest(postConfig);
     // check that we are actually logged on
     if (result === 'undefined' || result === '') {
-      return { error: true, result: 'http request failed' };
+      return {};
     }
     else if (result.data.indexOf('Incorrect password!') >= 0 || result.status > 200) {

[Killed] BinaryExpression
code/node-red-contrib-komfovent/komfnodes/komfovent.js:73:65
     if (result === 'undefined' || result === '') {
       return { error: true, result: 'http request failed' };
     }
-    else if (result.data.indexOf('Incorrect password!') >= 0 || result.status > 200) {
+    else if (result.data.indexOf('Incorrect password!') >= 0 || result.status >= 200) {
       return { error: true, result: 'Wrong password for unit' };
     }

[Killed] IfStatement
code/node-red-contrib-komfovent/komfnodes/komfovent.js:73:14
     if (result === 'undefined' || result === '') {
       return { error: true, result: 'http request failed' };
     }
-    else if (result.data.indexOf('Incorrect password!') >= 0 || result.status > 200) {
+    else if (true) {
       return { error: true, result: 'Wrong password for unit' };
     }

[NoCoverage] BooleanSubstitution
code/node-red-contrib-komfovent/komfnodes/komfovent.js:74:23
       return { error: true, result: 'http request failed' };
     }
     else if (result.data.indexOf('Incorrect password!') >= 0 || result.status > 200) {
-      return { error: true, result: 'Wrong password for unit' };
+      return { error: false, result: 'Wrong password for unit' };
     }
     else if (result.data.indexOf('value="Logout') >= 0 && result.status === 200) {

[NoCoverage] StringLiteral
code/node-red-contrib-komfovent/komfnodes/komfovent.js:74:37
       return { error: true, result: 'http request failed' };
     }
     else if (result.data.indexOf('Incorrect password!') >= 0 || result.status > 200) {
-      return { error: true, result: 'Wrong password for unit' };
+      return { error: true, result: "" };
     }
     else if (result.data.indexOf('value="Logout') >= 0 && result.status === 200) {

[Killed] IfStatement
code/node-red-contrib-komfovent/komfnodes/komfovent.js:76:14
     else if (result.data.indexOf('Incorrect password!') >= 0 || result.status > 200) {
       return { error: true, result: 'Wrong password for unit' };
     }
-    else if (result.data.indexOf('value="Logout') >= 0 && result.status === 200) {
+    else if (false) {
       // then assume we are logged on correctly
       return { error: false, result: 'logged on' };

[Killed] ConditionalExpression
code/node-red-contrib-komfovent/komfnodes/komfovent.js:76:14
     else if (result.data.indexOf('Incorrect password!') >= 0 || result.status > 200) {
       return { error: true, result: 'Wrong password for unit' };
     }
-    else if (result.data.indexOf('value="Logout') >= 0 && result.status === 200) {
+    else if (false && result.status === 200) {
       // then assume we are logged on correctly
       return { error: false, result: 'logged on' };

[Killed] BooleanSubstitution
code/node-red-contrib-komfovent/komfnodes/komfovent.js:78:23
     }
     else if (result.data.indexOf('value="Logout') >= 0 && result.status === 200) {
       // then assume we are logged on correctly
-      return { error: false, result: 'logged on' };
+      return { error: true, result: 'logged on' };
     }
     else {

[Killed] ObjectLiteral
code/node-red-contrib-komfovent/komfnodes/komfovent.js:78:14
     }
     else if (result.data.indexOf('value="Logout') >= 0 && result.status === 200) {
       // then assume we are logged on correctly
-      return { error: false, result: 'logged on' };
+      return {};
     }
     else {

[Survived] Block
code/node-red-contrib-komfovent/komfnodes/komfovent.js:80:10
       // then assume we are logged on correctly
       return { error: false, result: 'logged on' };
     }
-    else {
-      // seems like something unknown failed, the beauty of screenscraping
-      return { error: true, result: 'Something totally unknown happened with logon' };
-    }
+    else {}
   }// logon end
 

[NoCoverage] BooleanSubstitution
code/node-red-contrib-komfovent/komfnodes/komfovent.js:82:23
     }
     else {
       // seems like something unknown failed, the beauty of screenscraping
-      return { error: true, result: 'Something totally unknown happened with logon' };
+      return { error: false, result: 'Something totally unknown happened with logon' };
     }
   }// logon end

[NoCoverage] StringLiteral
code/node-red-contrib-komfovent/komfnodes/komfovent.js:82:37
     }
     else {
       // seems like something unknown failed, the beauty of screenscraping
-      return { error: true, result: 'Something totally unknown happened with logon' };
+      return { error: true, result: "" };
     }
   }// logon end

[Killed] Block
code/node-red-contrib-komfovent/komfnodes/komfovent.js:92:28
   * @param mode Input object mode{name: 'auto', code: '285=2'}, where code is the values Komfovent expects
   * @param ip address of the komfovent unit to set mode on
   */
-  async setMode (mode, ip) {
-    // validate input
-    if (typeof mode.code !== 'string' || !mode) {
-      return ({ error: true, result: 'Empty mode received, quitting' });
-    }
-    if (typeof ip !== 'string' || !ip) {
-      return ({ error: true, result: 'Empty IP received, quitting' });
-    }
-    // defining message needed by c6 to switch modes
-    const postConfig = {
-      url: 'http://' + ip + '/ajax.xml',
-      method: 'POST',
-      body: mode.code
-    };
-    // make request for mode change
-    const result = await this.makeRequest(postConfig);
-    if (result.status === 200 && result.data.indexOf('c6') > 0) {
-      // then assuming it was ok, right http and the weird standard body response from C6 controller
-      return { error: false, result: mode.name };
-    }
-    else {
-      return { error: true, result: 'Could not set mode. Non existing? ' + mode.name };
-    }
-  } // setmode end
+  async setMode (mode, ip) {} // setmode end
 
   // function to fetch mode

[Killed] BinaryExpression
code/node-red-contrib-komfovent/komfnodes/komfovent.js:94:9
   */
   async setMode (mode, ip) {
     // validate input
-    if (typeof mode.code !== 'string' || !mode) {
+    if (typeof mode.code === 'string' || !mode) {
       return ({ error: true, result: 'Empty mode received, quitting' });
     }

[Killed] PrefixUnaryExpression
code/node-red-contrib-komfovent/komfnodes/komfovent.js:94:42
   */
   async setMode (mode, ip) {
     // validate input
-    if (typeof mode.code !== 'string' || !mode) {
+    if (typeof mode.code !== 'string' || mode) {
       return ({ error: true, result: 'Empty mode received, quitting' });
     }

[NoCoverage] BooleanSubstitution
code/node-red-contrib-komfovent/komfnodes/komfovent.js:95:24
   async setMode (mode, ip) {
     // validate input
     if (typeof mode.code !== 'string' || !mode) {
-      return ({ error: true, result: 'Empty mode received, quitting' });
+      return ({ error: false, result: 'Empty mode received, quitting' });
     }
     if (typeof ip !== 'string' || !ip) {

[Killed] BinaryExpression
code/node-red-contrib-komfovent/komfnodes/komfovent.js:97:9
     if (typeof mode.code !== 'string' || !mode) {
       return ({ error: true, result: 'Empty mode received, quitting' });
     }
-    if (typeof ip !== 'string' || !ip) {
+    if (typeof ip === 'string' || !ip) {
       return ({ error: true, result: 'Empty IP received, quitting' });
     }

[Killed] PrefixUnaryExpression
code/node-red-contrib-komfovent/komfnodes/komfovent.js:97:35
     if (typeof mode.code !== 'string' || !mode) {
       return ({ error: true, result: 'Empty mode received, quitting' });
     }
-    if (typeof ip !== 'string' || !ip) {
+    if (typeof ip !== 'string' || ip) {
       return ({ error: true, result: 'Empty IP received, quitting' });
     }

[Killed] BinaryExpression
code/node-red-contrib-komfovent/komfnodes/komfovent.js:102:12
     }
     // defining message needed by c6 to switch modes
     const postConfig = {
-      url: 'http://' + ip + '/ajax.xml',
+      url: 'http://' - ip + '/ajax.xml',
       method: 'POST',
       body: mode.code

[Killed] BinaryExpression
code/node-red-contrib-komfovent/komfnodes/komfovent.js:102:12
     }
     // defining message needed by c6 to switch modes
     const postConfig = {
-      url: 'http://' + ip + '/ajax.xml',
+      url: 'http://' + ip - '/ajax.xml',
       method: 'POST',
       body: mode.code

[Killed] BinaryExpression
code/node-red-contrib-komfovent/komfnodes/komfovent.js:108:34
     };
     // make request for mode change
     const result = await this.makeRequest(postConfig);
-    if (result.status === 200 && result.data.indexOf('c6') > 0) {
+    if (result.status === 200 && result.data.indexOf('c6') <= 0) {
       // then assuming it was ok, right http and the weird standard body response from C6 controller
       return { error: false, result: mode.name };

[Killed] IfStatement
code/node-red-contrib-komfovent/komfnodes/komfovent.js:108:9
     };
     // make request for mode change
     const result = await this.makeRequest(postConfig);
-    if (result.status === 200 && result.data.indexOf('c6') > 0) {
+    if (false) {
       // then assuming it was ok, right http and the weird standard body response from C6 controller
       return { error: false, result: mode.name };

[Killed] BooleanSubstitution
code/node-red-contrib-komfovent/komfnodes/komfovent.js:110:23
     const result = await this.makeRequest(postConfig);
     if (result.status === 200 && result.data.indexOf('c6') > 0) {
       // then assuming it was ok, right http and the weird standard body response from C6 controller
-      return { error: false, result: mode.name };
+      return { error: true, result: mode.name };
     }
     else {

[Survived] Block
code/node-red-contrib-komfovent/komfnodes/komfovent.js:112:10
       // then assuming it was ok, right http and the weird standard body response from C6 controller
       return { error: false, result: mode.name };
     }
-    else {
-      return { error: true, result: 'Could not set mode. Non existing? ' + mode.name };
-    }
+    else {}
   } // setmode end
 

[NoCoverage] BooleanSubstitution
code/node-red-contrib-komfovent/komfnodes/komfovent.js:113:23
       return { error: false, result: mode.name };
     }
     else {
-      return { error: true, result: 'Could not set mode. Non existing? ' + mode.name };
+      return { error: false, result: 'Could not set mode. Non existing? ' + mode.name };
     }
   } // setmode end

[NoCoverage] BinaryExpression
code/node-red-contrib-komfovent/komfnodes/komfovent.js:113:37
       return { error: false, result: mode.name };
     }
     else {
-      return { error: true, result: 'Could not set mode. Non existing? ' + mode.name };
+      return { error: true, result: 'Could not set mode. Non existing? ' - mode.name };
     }
   } // setmode end

[Survived] Block
code/node-red-contrib-komfovent/komfnodes/komfovent.js:118:22
   } // setmode end
 
   // function to fetch mode
-  async getMode (ip) {
-    if (typeof ip !== 'string' || !ip) {
-      return ({ error: true, result: 'Empty IP received, quitting' });
-    }
-    try {
-      const scraped = await this.getData('data', ip);
-      const msgResult = scraped('.controlh-1').attr('data-selected', '1').text(); // .attr('data-selected');
-      console.dir(msgResult);
-      if (typeof msgResult === 'undefined' || !msgResult) {
-        return { error: true, result: 'Active mode not found', unit: ip };
-      }
-      else {
-        // seems like we got the data without errors
-        return { error: false, result: msgResult, unit: ip };
-      }
-    }
-    catch (error) {
-      return { error: true, result: 'Could not fetch data for mode: ' + error };
-    }
-  } // getMode end
+  async getMode (ip) {} // getMode end
 
   /* private getData()

[Survived] Block
code/node-red-contrib-komfovent/komfnodes/komfovent.js:119:40
 
   // function to fetch mode
   async getMode (ip) {
-    if (typeof ip !== 'string' || !ip) {
-      return ({ error: true, result: 'Empty IP received, quitting' });
-    }
+    if (typeof ip !== 'string' || !ip) {}
     try {
       const scraped = await this.getData('data', ip);

[Survived] BinaryExpression
code/node-red-contrib-komfovent/komfnodes/komfovent.js:119:9
 
   // function to fetch mode
   async getMode (ip) {
-    if (typeof ip !== 'string' || !ip) {
+    if (typeof ip !== 'string' && !ip) {
       return ({ error: true, result: 'Empty IP received, quitting' });
     }

[Survived] Block
code/node-red-contrib-komfovent/komfnodes/komfovent.js:122:9
     if (typeof ip !== 'string' || !ip) {
       return ({ error: true, result: 'Empty IP received, quitting' });
     }
-    try {
-      const scraped = await this.getData('data', ip);
-      const msgResult = scraped('.controlh-1').attr('data-selected', '1').text(); // .attr('data-selected');
-      console.dir(msgResult);
-      if (typeof msgResult === 'undefined' || !msgResult) {
-        return { error: true, result: 'Active mode not found', unit: ip };
-      }
-      else {
-        // seems like we got the data without errors
-        return { error: false, result: msgResult, unit: ip };
-      }
-    }
+    try {}
     catch (error) {
       return { error: true, result: 'Could not fetch data for mode: ' + error };

[Survived] StringLiteral
code/node-red-contrib-komfovent/komfnodes/komfovent.js:123:42
       return ({ error: true, result: 'Empty IP received, quitting' });
     }
     try {
-      const scraped = await this.getData('data', ip);
+      const scraped = await this.getData("", ip);
       const msgResult = scraped('.controlh-1').attr('data-selected', '1').text(); // .attr('data-selected');
       console.dir(msgResult);

[Survived] StringLiteral
code/node-red-contrib-komfovent/komfnodes/komfovent.js:124:70
     }
     try {
       const scraped = await this.getData('data', ip);
-      const msgResult = scraped('.controlh-1').attr('data-selected', '1').text(); // .attr('data-selected');
+      const msgResult = scraped('.controlh-1').attr('data-selected', "").text(); // .attr('data-selected');
       console.dir(msgResult);
       if (typeof msgResult === 'undefined' || !msgResult) {

[Survived] StringLiteral
code/node-red-contrib-komfovent/komfnodes/komfovent.js:124:53
     }
     try {
       const scraped = await this.getData('data', ip);
-      const msgResult = scraped('.controlh-1').attr('data-selected', '1').text(); // .attr('data-selected');
+      const msgResult = scraped('.controlh-1').attr("", '1').text(); // .attr('data-selected');
       console.dir(msgResult);
       if (typeof msgResult === 'undefined' || !msgResult) {

[Survived] IfStatement
code/node-red-contrib-komfovent/komfnodes/komfovent.js:126:11
       const scraped = await this.getData('data', ip);
       const msgResult = scraped('.controlh-1').attr('data-selected', '1').text(); // .attr('data-selected');
       console.dir(msgResult);
-      if (typeof msgResult === 'undefined' || !msgResult) {
+      if (true) {
         return { error: true, result: 'Active mode not found', unit: ip };
       }

[Survived] ConditionalExpression
code/node-red-contrib-komfovent/komfnodes/komfovent.js:126:11
       const scraped = await this.getData('data', ip);
       const msgResult = scraped('.controlh-1').attr('data-selected', '1').text(); // .attr('data-selected');
       console.dir(msgResult);
-      if (typeof msgResult === 'undefined' || !msgResult) {
+      if (true || !msgResult) {
         return { error: true, result: 'Active mode not found', unit: ip };
       }

[NoCoverage] BooleanSubstitution
code/node-red-contrib-komfovent/komfnodes/komfovent.js:127:25
       const msgResult = scraped('.controlh-1').attr('data-selected', '1').text(); // .attr('data-selected');
       console.dir(msgResult);
       if (typeof msgResult === 'undefined' || !msgResult) {
-        return { error: true, result: 'Active mode not found', unit: ip };
+        return { error: false, result: 'Active mode not found', unit: ip };
       }
       else {

[Survived] Block
code/node-red-contrib-komfovent/komfnodes/komfovent.js:129:12
       if (typeof msgResult === 'undefined' || !msgResult) {
         return { error: true, result: 'Active mode not found', unit: ip };
       }
-      else {
-        // seems like we got the data without errors
-        return { error: false, result: msgResult, unit: ip };
-      }
+      else {}
     }
     catch (error) {

[Survived] BooleanSubstitution
code/node-red-contrib-komfovent/komfnodes/komfovent.js:131:25
       }
       else {
         // seems like we got the data without errors
-        return { error: false, result: msgResult, unit: ip };
+        return { error: true, result: msgResult, unit: ip };
       }
     }

[Survived] Block
code/node-red-contrib-komfovent/komfnodes/komfovent.js:134:19
         return { error: false, result: msgResult, unit: ip };
       }
     }
-    catch (error) {
-      return { error: true, result: 'Could not fetch data for mode: ' + error };
-    }
+    catch (error) {}
   } // getMode end
 

[NoCoverage] BooleanSubstitution
code/node-red-contrib-komfovent/komfnodes/komfovent.js:135:23
       }
     }
     catch (error) {
-      return { error: true, result: 'Could not fetch data for mode: ' + error };
+      return { error: false, result: 'Could not fetch data for mode: ' + error };
     }
   } // getMode end

[NoCoverage] BinaryExpression
code/node-red-contrib-komfovent/komfnodes/komfovent.js:135:37
       }
     }
     catch (error) {
-      return { error: true, result: 'Could not fetch data for mode: ' + error };
+      return { error: true, result: 'Could not fetch data for mode: ' - error };
     }
   } // getMode end

[Killed] PrefixUnaryExpression
code/node-red-contrib-komfovent/komfnodes/komfovent.js:149:37
   async getData (name, ip) {
     // validate input
     // validate input
-    if (typeof name !== 'string' || !name) {
+    if (typeof name !== 'string' || name) {
       return ({ error: true, result: 'Empty ID received, quitting' });
     }

[Killed] IfStatement
code/node-red-contrib-komfovent/komfnodes/komfovent.js:149:9
   async getData (name, ip) {
     // validate input
     // validate input
-    if (typeof name !== 'string' || !name) {
+    if (true) {
       return ({ error: true, result: 'Empty ID received, quitting' });
     }

[NoCoverage] BooleanSubstitution
code/node-red-contrib-komfovent/komfnodes/komfovent.js:150:24
     // validate input
     // validate input
     if (typeof name !== 'string' || !name) {
-      return ({ error: true, result: 'Empty ID received, quitting' });
+      return ({ error: false, result: 'Empty ID received, quitting' });
     }
     if (typeof ip !== 'string' || !ip) {

[NoCoverage] ObjectLiteral
code/node-red-contrib-komfovent/komfnodes/komfovent.js:150:15
     // validate input
     // validate input
     if (typeof name !== 'string' || !name) {
-      return ({ error: true, result: 'Empty ID received, quitting' });
+      return ({});
     }
     if (typeof ip !== 'string' || !ip) {

[Killed] BinaryExpression
code/node-red-contrib-komfovent/komfnodes/komfovent.js:156:18
       return ({ error: true, result: 'Empty IP received, quitting' });
     }
     // change target to subpage if identity/name
-    const page = name.indexOf('_') > 0 ? 'det.html' : '';
+    const page = name.indexOf('_') <= 0 ? 'det.html' : '';
     // setup for get request
     const getConfig = {
