[Killed] ConditionalExpression
code/node-red-contrib-komfovent/komfnodes/komfovent.js:156:18
       return ({ error: true, result: 'Empty IP received, quitting' });
     }
     // change target to subpage if identity/name
-    const page = name.indexOf('_') > 0 ? 'det.html' : '';
+    const page = false ? 'det.html' : '';
     // setup for get request
     const getConfig = {

[Killed] BinaryExpression
code/node-red-contrib-komfovent/komfnodes/komfovent.js:159:12
     const page = name.indexOf('_') > 0 ? 'det.html' : '';
     // setup for get request
     const getConfig = {
-      url: 'http://' + ip + '/' + page,
+      url: 'http://' + ip + '/' - page,
       method: 'GET'
     };

[Killed] BinaryExpression
code/node-red-contrib-komfovent/komfnodes/komfovent.js:159:12
     const page = name.indexOf('_') > 0 ? 'det.html' : '';
     // setup for get request
     const getConfig = {
-      url: 'http://' + ip + '/' + page,
+      url: 'http://' - ip + '/' + page,
       method: 'GET'
     };

[Killed] Block
code/node-red-contrib-komfovent/komfnodes/komfovent.js:165:75
     // get the page and scrape it
     const result = await this.makeRequest(getConfig);
     // validate results before parsing
-    if (result !== 'undefined' && result && !result.error && result.data) {
-      // load scraper and scrape recieved content
-      const scraper = require('cheerio');
-      const scraped = scraper.load(result.data);
-      return scraped;
-    }
+    if (result !== 'undefined' && result && !result.error && result.data) {}
     else {
       throw new Error('Could not fetch page: ' + result.result);

[Killed] PrefixUnaryExpression
code/node-red-contrib-komfovent/komfnodes/komfovent.js:165:45
     // get the page and scrape it
     const result = await this.makeRequest(getConfig);
     // validate results before parsing
-    if (result !== 'undefined' && result && !result.error && result.data) {
+    if (result !== 'undefined' && result && result.error && result.data) {
       // load scraper and scrape recieved content
       const scraper = require('cheerio');

[Killed] StringLiteral
code/node-red-contrib-komfovent/komfnodes/komfovent.js:167:31
     // validate results before parsing
     if (result !== 'undefined' && result && !result.error && result.data) {
       // load scraper and scrape recieved content
-      const scraper = require('cheerio');
+      const scraper = require("");
       const scraped = scraper.load(result.data);
       return scraped;

[Survived] Block
code/node-red-contrib-komfovent/komfnodes/komfovent.js:171:10
       const scraped = scraper.load(result.data);
       return scraped;
     }
-    else {
-      throw new Error('Could not fetch page: ' + result.result);
-    }
+    else {}
   } // getData end
 

[Survived] BinaryExpression
code/node-red-contrib-komfovent/komfnodes/komfovent.js:172:23
       return scraped;
     }
     else {
-      throw new Error('Could not fetch page: ' + result.result);
+      throw new Error('Could not fetch page: ' - result.result);
     }
   } // getData end

[Killed] Block
code/node-red-contrib-komfovent/komfnodes/komfovent.js:181:26
   * TODO
   * @param Name of the datafield to fetch. IDs defined in C6 web setup, documented in README and reverse.md
   */
-  async getId (name, ip) {
-    // validate input
-    if (typeof name !== 'string' || !name) {
-      return ({ error: true, result: 'Empty ID received, quitting' });
-    }
-    if (typeof ip !== 'string' || !ip) {
-      return ({ error: true, result: 'Empty IP received, quitting' });
-    }
-    try {
-      const scraped = await this.getData(name, ip);
-      const msgResult = scraped('#' + name).text().trim();
-      if (typeof msgResult === 'undefined' || !msgResult || msgResult === '') {
-        return { error: true, result: 'ID not found', unit: ip };
-      }
-      else {
-      // seems like we got the data without errors
-        return { error: false, result: msgResult, unit: ip };
-      }
-    }
-    catch (error) {
-      return { error: true, result: 'Could not fetch data: ' + error };
-    }
-  } // getId end
+  async getId (name, ip) {} // getId end
 };
 

[Killed] IfStatement
code/node-red-contrib-komfovent/komfnodes/komfovent.js:183:9
   */
   async getId (name, ip) {
     // validate input
-    if (typeof name !== 'string' || !name) {
+    if (false) {
       return ({ error: true, result: 'Empty ID received, quitting' });
     }

[Killed] BinaryExpression
code/node-red-contrib-komfovent/komfnodes/komfovent.js:183:9
   */
   async getId (name, ip) {
     // validate input
-    if (typeof name !== 'string' || !name) {
+    if (typeof name === 'string' || !name) {
       return ({ error: true, result: 'Empty ID received, quitting' });
     }

[Killed] StringLiteral
code/node-red-contrib-komfovent/komfnodes/komfovent.js:184:38
   async getId (name, ip) {
     // validate input
     if (typeof name !== 'string' || !name) {
-      return ({ error: true, result: 'Empty ID received, quitting' });
+      return ({ error: true, result: "" });
     }
     if (typeof ip !== 'string' || !ip) {

[Killed] Block
code/node-red-contrib-komfovent/komfnodes/komfovent.js:189:9
     if (typeof ip !== 'string' || !ip) {
       return ({ error: true, result: 'Empty IP received, quitting' });
     }
-    try {
-      const scraped = await this.getData(name, ip);
-      const msgResult = scraped('#' + name).text().trim();
-      if (typeof msgResult === 'undefined' || !msgResult || msgResult === '') {
-        return { error: true, result: 'ID not found', unit: ip };
-      }
-      else {
-      // seems like we got the data without errors
-        return { error: false, result: msgResult, unit: ip };
-      }
-    }
+    try {}
     catch (error) {
       return { error: true, result: 'Could not fetch data: ' + error };

[Killed] BinaryExpression
code/node-red-contrib-komfovent/komfnodes/komfovent.js:191:33
     }
     try {
       const scraped = await this.getData(name, ip);
-      const msgResult = scraped('#' + name).text().trim();
+      const msgResult = scraped('#' - name).text().trim();
       if (typeof msgResult === 'undefined' || !msgResult || msgResult === '') {
         return { error: true, result: 'ID not found', unit: ip };

[Killed] Block
code/node-red-contrib-komfovent/komfnodes/komfovent.js:192:79
     try {
       const scraped = await this.getData(name, ip);
       const msgResult = scraped('#' + name).text().trim();
-      if (typeof msgResult === 'undefined' || !msgResult || msgResult === '') {
-        return { error: true, result: 'ID not found', unit: ip };
-      }
+      if (typeof msgResult === 'undefined' || !msgResult || msgResult === '') {}
       else {
       // seems like we got the data without errors

[Killed] IfStatement
code/node-red-contrib-komfovent/komfnodes/komfovent.js:192:11
     try {
       const scraped = await this.getData(name, ip);
       const msgResult = scraped('#' + name).text().trim();
-      if (typeof msgResult === 'undefined' || !msgResult || msgResult === '') {
+      if (false) {
         return { error: true, result: 'ID not found', unit: ip };
       }

[Killed] BooleanSubstitution
code/node-red-contrib-komfovent/komfnodes/komfovent.js:193:25
       const scraped = await this.getData(name, ip);
       const msgResult = scraped('#' + name).text().trim();
       if (typeof msgResult === 'undefined' || !msgResult || msgResult === '') {
-        return { error: true, result: 'ID not found', unit: ip };
+        return { error: false, result: 'ID not found', unit: ip };
       }
       else {

[Killed] ObjectLiteral
code/node-red-contrib-komfovent/komfnodes/komfovent.js:197:16
       }
       else {
       // seems like we got the data without errors
-        return { error: false, result: msgResult, unit: ip };
+        return {};
       }
     }

[Killed] Block
code/node-red-contrib-komfovent/komfnodes/komfovent.js:200:19
         return { error: false, result: msgResult, unit: ip };
       }
     }
-    catch (error) {
-      return { error: true, result: 'Could not fetch data: ' + error };
-    }
+    catch (error) {}
   } // getId end
 };

[Killed] BooleanSubstitution
code/node-red-contrib-komfovent/komfnodes/komfovent.js:201:23
       }
     }
     catch (error) {
-      return { error: true, result: 'Could not fetch data: ' + error };
+      return { error: false, result: 'Could not fetch data: ' + error };
     }
   } // getId end

[Killed] BinaryExpression
code/node-red-contrib-komfovent/komfnodes/komfovent.js:201:37
       }
     }
     catch (error) {
-      return { error: true, result: 'Could not fetch data: ' + error };
+      return { error: true, result: 'Could not fetch data: ' - error };
     }
   } // getId end
